{"Cosmology/Cosmology":{"title":"Cosmology","links":["Cosmology/Gods-and-religion/The-Gods-of-Dwalen","Cosmology/Magic/Magic-in-Dwalen","Cosmology/Universal-model/Universal-model-of-Dwalen"],"tags":[],"content":"Here you can find out more about the several aspects that pertain to the cosmology of Dwalen.\nThe Gods of Dwalen\nMagic in Dwalen\nUniversal model of Dwalen"},"Cosmology/Gods-and-religion/Elder-beings/Angels-of-Anduul":{"title":"Angels of Anduul","links":["tags/divinity","tags/elder"],"tags":["divinity","elder"],"content":"#divinity#elder-beings"},"Cosmology/Gods-and-religion/Elder-beings/Demons":{"title":"Demons","links":["tags/divinity","tags/elder","tags/demons"],"tags":["divinity","elder","demons"],"content":"#divinity#elder-beings#demons"},"Cosmology/Gods-and-religion/Elder-beings/Elder-beings":{"title":"Elder beings","links":["tags/divinity","tags/elder","Cosmology/Gods-and-religion/Elder-beings/Demons","Cosmology/Gods-and-religion/Elder-beings/Angels-of-Anduul","Cosmology/Gods-and-religion/Elder-beings/Three-minds-of-Zor-Kovul"],"tags":["divinity","elder"],"content":"#divinity#elder-beings\nHigher beings are beings that exist in higher dimensions, and have always done so. Where Ascended forced and carved their own way into Divinity, Elder beings were born into it. They are incredibly powerful and ill understood.\nMost of them have no interest in Dwalen or the Ascended, but some of them took note. Intrigued by the ‘game’ the Ascended played, they tried their own hand at being a God to mortals. Some of them took a liking to it.\nSome of the more known Elder beings are the Demons, the Angels of Anduul or the Three minds of Zor Kovul."},"Cosmology/Gods-and-religion/Elder-beings/Kvolt":{"title":"Kvolt","links":["tags/divinity","tags/elder","tags/demons","Cosmology/Gods-and-religion/Elder-beings/Demons"],"tags":["divinity","elder","demons"],"content":"#divinity#elder-beings#demons\nKvolt is one of the high Demons, a prince even, of the Demonic plane."},"Cosmology/Gods-and-religion/Elder-beings/Three-minds-of-Zor-Kovul":{"title":"Three minds of Zor Kovul","links":["tags/divinity","tags/elder"],"tags":["divinity","elder"],"content":"#divinity#elder-beings"},"Cosmology/Gods-and-religion/Misscended":{"title":"Misscended","links":["tags/divinity"],"tags":["divinity"],"content":"#divinity\nSometimes, an ascension ritual went awry. Not enough power was provided, the mage lacked the required skills or a myriad of other variables could go wrong. The end result then is something altogether different from a God or Spirit of the land. Something best described as a ‘thing’. Something that exists, but really should not.\nUsually, these ‘things’ don’t last long. Devoured by multidimensional horrors, as a light snack. But the void between planes is large, and some of them live long enough to learn how to survive. Outside of the bounds of heaven, in between the horrors. These become things to fear. For when one lives amongst the horrors in between worlds, one becomes horror.\nWorshipping one of these ‘Ungods’ is inviting sanity into one’s mind. They are chaos, they devour, they do not repay. Yet, some folk find their way into worshipping them. These cults luckily do not survive long, for gaining the focus of one such being usually ends in a gruesome death."},"Cosmology/Gods-and-religion/Spirits-of-the-land/Fulfelt":{"title":"Fulfelt","links":["tags/divinity","tags/spirits","Cosmology/Gods-and-religion/Spirits-of-the-land/Spirits-of-the-land"],"tags":["divinity","spirits"],"content":"#divinity#spirits-of-the-land\nOne of the Spirits of the land that roam around in Dwalen. A spirit tied to the element of Fire."},"Cosmology/Gods-and-religion/Spirits-of-the-land/Spirits-of-the-land":{"title":"Spirits of the land","links":["tags/divinity","tags/spirits","Cosmology/Gods-and-religion/Spirits-of-the-land/Fulfelt"],"tags":["divinity","spirits"],"content":"#divinity#spirits-of-the-land\nSpirits of the land are strange beings. They are the end result of an Ascension ritual that did not complete fully, but did not go awry either. They could be seen as half gods. Spirits are immortal beings and dwell in Dwalen. They ride the perfect razor edge of being Divine enough to be immortal, but mundane enough, to be able to exist fully in the mundane plane.\nOften, these spirits have forfeited, forgotten or sacrificed part of their personality, their self, and bonded themselves to a certain idea, element or aspect of the world. Molding their entire existence and character to it. Why this happens is even a mystery to the Gods, for any Ascended does not recall a moment in the Ascension ritual where they would end up like this. It is accepted as one of the quirks of failed Ascension.\nSome examples of spirits could be water or fire spirits. Bound to springs, seas and volcanoes. Depending on their might, they can exert remarkable control over their bound element. Spirits can be incredibly strong but luckily are often lethargic and not interested in mundane desires. Power, dominance, wealth, none of these carry importance to them. Instead, Spirits are often whimsical and childish. With the temperament of a child, they can be quickly swayed with the right boon or offer, but are equally as quickly angered.\nA list of all the Spirits of the land:\n\nFulfelt\n\nVaria notes on spirits §\nspirits can have children. These are not really children but an affect of their mind further fracturing due to their existence. These children are small fragments and usually are mini versions of the spirits form and mind"},"Cosmology/Gods-and-religion/The-Ascended/Andeol":{"title":"Andeol","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Ashmaal":{"title":"Ashmaal","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Iva":{"title":"Iva","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Keft":{"title":"Keft","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Kvilt":{"title":"Kvilt","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Lims":{"title":"Lims","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Lodvest":{"title":"Lodvest","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Melio":{"title":"Melio","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Molo":{"title":"Molo","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/Pereodim":{"title":"Pereodim","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Ascended/The-Ascended":{"title":"The Ascended","links":["tags/divinity","History/Ancient-history/The-age-of-Ascension","Cosmology/Gods-and-religion/The-Ascended/Pereodim","Cosmology/Gods-and-religion/The-Ascended/Kvilt","Cosmology/Gods-and-religion/The-Ascended/Usiri","Cosmology/Gods-and-religion/The-Ascended/Ashmaal","Cosmology/Gods-and-religion/The-Ascended/Iva","Cosmology/Gods-and-religion/The-Ascended/Melio","Cosmology/Gods-and-religion/The-Ascended/Lodvest","Cosmology/Gods-and-religion/The-Ascended/Andeol","Cosmology/Gods-and-religion/The-Ascended/Keft","Cosmology/Gods-and-religion/The-Ascended/Lims","Cosmology/Gods-and-religion/The-Ascended/Molo","Ur","Malifara","Zim-Balaam","Vurn-Aagi","Tinkris","Oft"],"tags":["divinity"],"content":"#divinity\nAscension was a long, intricate and complex magical ritual that came into being during the height of the Psionic ages. Magi, who wielded magic by mere thought back then, found a way to transcend their mundane and mortal forms. To stitch their souls to divine flesh, and ascend to a higher plane of existence. Reaching Divinity.\nThe ritual required a lot of energy, resources and knowledge. It was limited to the best of the best, purely because of the skill ceiling. This caused a lot of the best psionic magi to leave the world, in a time when they were needed most. (The age of Ascension)\nA list of all the Ascended Gods:\n\nPereodim\nKvilt\nUsiri\nAshmaal\nIva\nMelio\nLodvest\nAndeol\nKeft\nLims\nMolo\nUr\nMalifara\nZim Balaam\nVurn Aagi\nTinkris\nOft\n"},"Cosmology/Gods-and-religion/The-Ascended/Usiri":{"title":"Usiri","links":["tags/divinity","tags/ascended"],"tags":["divinity","ascended"],"content":"#divinity#ascended"},"Cosmology/Gods-and-religion/The-Gods-of-Dwalen":{"title":"The Gods of Dwalen","links":["tags/divinity","Cosmology/Gods-and-religion/The-Ascended/The-Ascended","Cosmology/Gods-and-religion/Spirits-of-the-land/Spirits-of-the-land","Cosmology/Gods-and-religion/Elder-beings/Elder-beings","Cosmology/Gods-and-religion/Misscended"],"tags":["divinity"],"content":"#divinity\nDwalen has known many Gods over the ages. Some real, some figments of collective imagination. The gods listed here are merely the ones that are still known in the world. Many more have existed, and perhaps still do, but without any real ties left to the world of Dwalen.\nGods can be divided up in the following categories:\n\nThe Ascended - Mortals that ascended to Godhood\nSpirits of the land - Higher beings tied to Dwalen\nElder beings - Divine beings that have always existed in a higher state of being\nMisscended - Those that tried to ascend, but failed\n\nThe Ascended are the Gods that are worshipped the most in Dwalen, and in a structured framework. The Gods are seen as a pantheon, but depending on culture, following or location, people can worship all of them, see some of them as bad or evil, or see some of them as false Gods entirely.\nSpirits of the land are seen more as mystical forces of nature. They are rather respected than worshipped. Being given gifts and ritual thanks in return for favors. Usually worshipped in fringe and border regions.\nElder beings have often little interest in the world of Dwalen. But some of them saw how the Ascended interacted with it, and started to mimic them. When they are worshipped, they are often worshipped in the same manner. But they have far less stakes in the fate of Dwalen than the Ascended do."},"Cosmology/Magic/Loose-notes/On-blood-and-magic":{"title":"On blood and magic","links":[],"tags":[],"content":"Blood is important.\nBlood carries magical energy, and is also an important factor in magical potential to some degree.\nBlood is important -&gt; The Duri have been altered once like the Anari have been. Traits of Duri blood where used as a tracker for them\nBlood is tied to magic as well.\nOne’s Aurem/Aurym is tied by blood. And because of the close relation between Aurym and blood, blood can be used for revival. It has to be the blood of the one to be revived though. Blood is the only thing that can be used\nas a tracker for bringing back the dead. This is not common knowledge"},"Cosmology/Magic/Loose-notes/loose-notes":{"title":"loose notes","links":["Cosmology/Magic/Loose-notes/On-blood-and-magic"],"tags":[],"content":"A collection of loose notes that have to worked further out to decide if they are good enough or not.\nTo sort §\neveressence\nMagic pattersn can take up the form of flowers -&gt; indian chakra shit\nthere exist magical principles, overarching ideas that grant enlightenment\ntied to mind levels\ntied to martial marts\nAum conversdion principles are base spell components that convert refined Aum into a usable spell energyu. Weaker energy types are easier to convert byt less effective.\npeak magic user is balanced between channeling and spells, can continously channel for overal body increase, and fight while weaving spells.\nhealing magical spells are called mendings. They mend the flesh and soul, lesser mendings are for small wounds or to stabilize and so on and so forth.\nHealing magic calls for large amounts of power and energy and needs alchemical substances to aide the process as well.\nWhile healing magic can heal on its own, substances lower the needed energy amounts, which are absurd otherwise\nCurses\n-&gt; spells that have some degree of reflection and automation. They keep iterating over itself, corrupting and transforming living matter.\nmental maghics, you move you7r mind through another mind, conquering it like that. it is abstract byt can be seen as moving through as well and stuff\nhis mind moved through hers, she couild feel him conquer part after part\nancient roads where magitech that fueled magic robots and carsd as they traveresed over it\nuntil one opens their mind they are protected by a strong natural force. it is lamost impenetrable by most magi\nbut once one creates their mind fortrtess and opens their mind to the mental realm, they become vuirrnerab;e and need to make their own deencces\nthe benefit of this is that magi can start to make spells with their projected self, eventually leanring to work with their corporeal form and their incorporeal form at the same time\nthis takes practice though and is usually reserved for higher end thrid levels\nwhen projecten self gets shattered, it is akin to losing consciousness and it takes a while to regain it\nSoul flame. A magical fire that only affects the soul and Aurem. You can not see it burn in the mortal realm but can see it in the mind realm. If left to burn it will destroy the soul and aurem of a person, but it can be controlled to cause great pain\nan effective way of torture\nAurem can be used to sense more of the surroundings. A mix of sensing the mind realm as well as Aum traces in the mortal realm give more feedback of the surroundings. This requires a higher mind cultivation to process tho\nparallel minds\nUsing Y instead of I is done when we talk about things of a magical nature, or that are influenced by magic. Examples: Vampyr, Wyld, Goblyn, Aurym, …\nMagic can be used to enchant items. Enchanting items works best on strict geometric forms. Squares, circles, rectangles, triangles.\nEach geometric form is best used for a single enchantment. But multiple forms can be combined in one item, and allowed to work together if the enchanter has enough skill. Eg an amulet made out of a circle and several triangles could have multiple enchantments working together.\nFor this reason, swords are often rectangular in shape if they are meant to be enchanted.\nlegendary artefact -&gt; sword made out of tiny triangles, fitted together. all enchanted -&gt; This is also how Godlike avatar weapons where made, but with even smaller and more triangles. As enchanting does not require a large space in the corporeal.\nIDEA: Magic that is mentally cast has to be written still. Only now the Mental/ mind eye form of the user is writing the spell in the Mental realm. In their mind fortress, or outside of it, depending on if it has to be externally or not.\nMental realm is fluid. The projection can choose to exist in the mind fortress, or outside of it in the mental realm.\nmagic channeling can have different effects and efficiencies depending on how it is circulated through the nervures\nexamples: 13-VA37\nraw casting: exhuming pure magical enmergy without refining it hrough spellcraft\nconcord\nspiritualists are incredibly strong. they are people who merge with spirtis, asfter making a contract with them. this usually costs them a lot, usually in terms of soul or life, but yeilds incredible powers. some spiritualists subdue spirits instead of making dealsd with them.\nLinked notes §\n\n*On blood and magic\n"},"Cosmology/Magic/Magic-in-Dwalen":{"title":"Magic in Dwalen","links":["Notes-on-Aum","Cosmology/Magic/Loose-notes/loose-notes"],"tags":["magic"],"content":"ladida\nNotes on Aum, Everessence and magical energy §\n\nNotes on Aum\n\nNotes on Spells and spellcrafting §\nddd\nNotes on the mind, mind castles and projection §\ndd\nVarious notes: §\nloose notes"},"Cosmology/Universal-model/Universal-model-of-Dwalen":{"title":"Universal model of Dwalen","links":[],"tags":[],"content":""},"Dwalen-geography/Geography":{"title":"Geography","links":["Dwalen-geography/Merea/Merea"],"tags":[],"content":"Merea"},"Dwalen-geography/Merea/Akhalonia":{"title":"Akhalonia","links":[],"tags":[],"content":""},"Dwalen-geography/Merea/Doryn":{"title":"Doryn","links":[],"tags":[],"content":""},"Dwalen-geography/Merea/Merea":{"title":"Merea","links":["Dwalen-geography/Merea/Phrysia","Dwalen-geography/Merea/Akhalonia","Dwalen-geography/Merea/Vod-Durim","Dwalen-geography/Merea/Moravia","Dwalen-geography/Merea/The-Periphery","Dwalen-geography/Merea/Doryn","Dwalen-geography/Merea/Tryn"],"tags":[],"content":"Merea are the lands that once were part of the Merean empire. With the empire gone, there are various smaller kingdoms here now.\nPhrysia\nAkhalonia\nVod Durim\nMoravia\nThe Periphery\nDoryn\nTryn"},"Dwalen-geography/Merea/Moravia":{"title":"Moravia","links":[],"tags":[],"content":""},"Dwalen-geography/Merea/Phrysia":{"title":"Phrysia","links":[],"tags":[],"content":""},"Dwalen-geography/Merea/The-Periphery":{"title":"The Periphery","links":[],"tags":[],"content":""},"Dwalen-geography/Merea/Tryn":{"title":"Tryn","links":[],"tags":[],"content":""},"Dwalen-geography/Merea/Vod-Durim":{"title":"Vod Durim","links":[],"tags":[],"content":""},"History/Ancient-history/The-age-of-Ascension":{"title":"The age of Ascension","links":["tags/history","tags/ancient"],"tags":["history","ancient"],"content":"#history#ancient-history"},"Name-pools":{"title":"Name pools","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCountry namesGallivanPhrysiaGaelythByrelleZaronCanaan"},"Notes-on-Aum":{"title":"Notes on Aum","links":["On-the-nature-of-the-everessence","On-the-nature-of-Aum"],"tags":[],"content":"\n\n\n*On the nature of the everessence\n\n\nOn the nature of Aum\n"},"On-the-nature-of-Aum":{"title":"On the nature of Aum","links":[],"tags":[],"content":""},"On-the-nature-of-the-everessence":{"title":"On the nature of the everessence","links":[],"tags":[],"content":""},"Primer":{"title":"Primer","links":["Cosmology/Cosmology","Dwalen-geography/Geography"],"tags":[],"content":"This is the primer for the fantasy world of Dwalen.\nFor now, it is barren, content will be added soon though.\nIn the meantime, why don’t you check out Cosmology?\nOr get all into the Geography of Dwalen?"},"Unsorted-notes---raw":{"title":"Unsorted notes - raw","links":[],"tags":[],"content":"STORY: FMC or somebody else has Prophecy like powers, A prophecy reaches her about the oncomming doom for merea from the Urists. But she also sees a sliver of hope. MMC. So she goes out to meet them. perhaps this is why the boars are where the MMC is fighting off the Wyldekin for the\ncommon folk being attacked by them on the border.\nNo! I will not be swayed by your silver tongue work!\nQuote by some badass: It is not up to you or me to judge that. It is something between them and their god. But I can arrange for them to meet their god. And that is exactly what I am going to do\nthe order identifies with a sort of flower. purple perhaps, MCs youngest sister remembers seeing this flower on the MASTER that bought MC. and when he meets her again, at the end of her life, she has been telling people to look out for the strange flower\nas the flower does not grow in Merea\nnovel 1 should end with a strong magical energy surge, somewhere distant, very distant, but extremely powerfulelise\nMC kneels down and starts to cry. When Valens and sis ask what is the matter he says this means his master has failed his quest and is probablt dead\nidea: some old mage is encased in keepstone, but a very clear trasnparant variant. A myth exists around them. The man frozen in glass at the bottom of the lake.\nDurym are short and stocky build. Suited for being walking fortresses, fighting hordes of stone folk.\nwyld folk are tribal and shamanistic. They live in close harmony with nature and the spyrits. They have odd views on decency, death, and how to live life. They see clothing more as protection for when they need it, and have no issues with being naked.\nVod Durym/ Duresh was once a gateway city. Meaning it is connected to a vast tunnel system that traverses through the thick of the diskworld. ending up on the other side. The city on the other side possibly fell, in any case, in between them now sit the stone folk. So they are cut off from the other side.\nAt the core of Phrysia reside the Ur cultists. They offered so many in his name, that there is os much sacrifical energy, that cant go anywhere because of the blockade that the other gods put up. that it pools there, the air thick with the energy.\nThis allowed Ur to reach Dwalen via other ways, the demonic plane. allowing him to talk to his followers, increase magical artefacts that allowed him to appear more easy. Eventually coming over entirely while inhabiting a demon body, only for a few moment.\nThe divine power is so thick that lesser, higher dimensional beings seep through tiny cracks, along with demons. The Urists use these in their army\nbig, rideable pigs for Dwalen\nThey are huge, sturdy, loyal and intelligent\nDuri &lt;&gt; Duresh\nDuri = the species\nDuresh = other species that joined the Durim\nDurim = collective term\nAnari where once the Elfin, Elves, blessed by their God\nBut after the corruption, they became the Anari, the fallen in their tongue\nMalformed by divine curses\nAkhalonia knew of the coming attack from Phrysia, so they prepared and grew stronger. Strong enough that Phrysia would have called off theur\nTHe tower lords of Phrysia. The gigantic towers were a different approach to survive the cataclysm. Instead of building gigantic fortress cities high up against mountains, they build huge towers in which to hole up in.\nwifwolf -&gt; female werewolf\nSome entitities can split themselves up in lesser entitities that then are a hive mind. They can gather into one again as well. to become extremely stron g beings. We need a species based on this.\nDuri use anari weapons. Anari weapons are so enchanted that they easily cut throught he stone folk things\n-&gt; Anari weapons glow golden yellow\nFinn brings encahntment rtech to the Duri via Valens. His weapons are not as good as Anari weapons but good enough to go toe to toe with them. With his tech they can also mass produce them\nThe Duri have some rudimentary Gunpowder tech and cannons and muskets.\nThey also have magic fuelled muskets. These are reloaded by charging them with mana. This looks as if magical fog/ smoke from your hand is moved into the chamber.\nQuant comes from Durim, so he has access to both a magical musket as powder musket. He also has knowledge of the stone folk and recognises them when they meet them in the Wylde.\ncat folk\ndifferent races in species\n-&gt; bigger, or smaller\n-&gt; longer or shorter or no tails\nThe Pallas as a cat folk sub species\nvillages and towns in the periphery always have watches in the night\nFor wildfolk or monsters or bandits or worse …\nMC Dwalen is evry skilled in actual combat. Learned to wield his weapons while also keeping his movement up, never getting surrounded because he trained in the Wyld\nsaying: to piss in GODNAME’s cup\nwinter berries\nconan 8 as inspi\na band of free lances -&gt; mercenaris\nthe red brotherhood\nidea for cultural myth around death. It is not creepy, it is a kind and warm person guiding you to the next life, possibly motherly aspects to it.\nthe kingdom of the peninsual to the bottom right is relatively safe. no wyld near them. They are known for their art, wine and fine food. Also great merchantry\nthe tower lords of vylyth are all cultists of Ur.\nTheir huge towers are possible by using magical skeleton pillars inside.\nWhen a new Tower lord is appointed, they take their cultists with them and grow a new skeleton with their Urian magic.\nThis requirtes a lot of blood and this is usually the reason for them going to war\nThe war on Akhalon was for this reason. And even though it is considered a loss for Vylyth, they finished their new tower.\nmagical contemplation - various levels\nfirst it slows your need for food and drink\nthen it fully negates it\nthe final stage it to prevent aging even\nSeels -&gt; money\nSome magical entitties in the spirit realm can be so powerful that coming near them, and inspecting the,m in the spirit realm is enough to damage you\nBerunds palm\na spell that creates a energetic palm strike that creates a shockwave and sends enemies flying back\nYou have one incense stick’s worht of time -&gt; unit of time\nFor game\nMajor level minor level\nAdapt       1-10\nReaching new magical levels extends ones life by x years\n=&gt; mental levels\nYama -&gt; God of the death\nthe examplars\na species neutered\ntook their own excellence away\nto be equal\nbecause they did not learn to embrace each other"},"index":{"title":"index","links":["Primer","Name-pools"],"tags":[],"content":"Please head over to Primer to get started reading up on the world of Dwalen.\nResourses\n\nName pools*\n"}}